{
  "insults": [
    "Now, I ain't saying _name is a Gold Digger, but _name has collected _totalGoldEarned gold.  So yeah, a gold digger.",
    "_name has killed _totalChampionKills enemy summoners!  And YOU think you can try em'?  Well, they do look like a pushover...",
    "I'm not saying that _losses losses is bad, but what I AM saying is it's not good.  At all.  It's bad.  Your bad.",
    "So _name here has _totalAssists Assists.  Couldn't do it yourself?  There's no I in 'team', but there sure as hell one in 'Independent'.",
    "_name has _wins wins?  Those are against bots, right?",
    "With a pathetic _totalChampionKills kills to their name, _name is the Yamcha of the LoL world.",
    "_losses losses?  Well _name, at least your tears will provide sustenance for some sort of plant or something.",
    "Hey _name, you're great.  You should write a guide for your champ.  Here's Step 1: Uninstall.",
    "With a miserable _losses losses to their name, it has been scientifically proven that _name throws games faster than any speed barrier known to man.",
    "_name managed to capture _maxNodeCapture nodes on their best day.  Granted, it was the worst day for everyone else on the team, but good for _name.",
    "_name has played _botGamesPlayed against the Bots.  _botGamesPlayed times alone.  _botGamesPlayed times forgotten.",
    "According to the stats, _name has offed _totalNodeCapture turrets.  You know, that job your supposed to make the minions do.  Unless you don't have anything better to do I guess.",
    "_name has captured _totalNodeCapture nodes.  Good job finding out your best skill is standing still in one spot.",
    "_name's high score is _maxCombatPlayerScore in combat.  Your hours of playing have been reduced to a number.  You just think about that.",
    "_name has _totalAssists assists and has proven that even a broken summoner can be right twice a day.",
    "Here's a site to put in your bookmarks _name: http://bit.ly/wng0ek",
    "_name is a Scrub!  SCRUB!  SSSCCCCRRRRRRRUUUUUUBBBBBBBBBBB!!!!!!",
    "_name has on their best day killed _maxChampionsKilled Champions.  I'd be chanting 'MVP, MVP', but that implies that this number is impressive.",
    "_name, your your largest critical strike reads out to a WHOPPING _maxLargestCriticalStrike!  If you can't count that high, I understand.  It's a big number and you might not have enough fingers and toes to get that high.",
    "According to me, _name has played _normalGamesPlayed normal games.  Then again, any game you're in can't be considered normal, unless bad play is the norm now.",
    "_name has _totalFirstBlood First Bloods.  Also _name has an average intellect during a game that ends up with a negative I.Q. by the way your chat logs go.",
    "According to me, _name has killed _maxChampionsKilled Champions in one game, putting them in the class of player who is a damn force of nature.  Specifically, they're gravity, and they're pulling everyone around them down.",
    "_name's new name should be 'Iron Chef'.  Once died _maxNumDeaths times in a game, and could feed everyone in Kitchen Stadium.  A LA QUISINE!!!",
    "_name's _totalDeathsPerSession total deaths per session has me convinced that we should just send _name to Africa to solve this feeding problem.",
    "_name has taken _totalDamageTaken points of damage this season, and name's parents have probably regreted certain life choices ALL THE TIME."
  ]
}